[{ "term": "abort", "definition": "To terminate a process prior to completion" }, { "term": "address", "definition": "A number, character, or group of characters that identifies a given device or storage location." }, { "term": "alias", "definition": "In an internet, a name assigned to a server that makes the server independent of the name of its host machine." }, { "term": "anomaly", "definition": "Anything observed in the documentation or operation of software that deviates from expectations based on previously verified software products or reference documents." }, { "term": "applet", "definition": "An application program, written in the Java programming language, that can be retrieved from a Web server and executed by a Web browser." }, { "term": "array", "definition": "An n-dimensional ordered set of data items identified by a single name and one or more indices, so that each element of the set is individually addressable." }, { "term": "avatar", "definition": "A graphical icon that represents a real person in a cyberspace system." }, { "term": "back end", "definition": "the part of a computer system not directly interacting with the user." }, { "term": "backup", "definition": "A system, component, file, procedure, or person available to replace or help restore a primary item in the event of a failure or externally caused disaster." }, { "term": "batch", "definition": "Pertaining to a system or mode of operation in which inputs are collected and processed all at one time, rather than being processed as they arrive, and a job, once started, proceeds to completion without additional input or user interaction." }, { "term": "bind", "definition": "To assign a value to an identifier. For example, to assign a value to a parameter or to assign an absolute address to a symbolic address in a computer program." }, { "term": "bitmap", "definition": "A representation of an image by an array of bits." }, { "term": "block", "definition": "A group of contiguous storage locations, computer program statements, records, words, characters, or bits that are treated as a unit." }, { "term": "boot", "definition": "To initialize a computer system by clearing memory and reloading the operating system." }, { "term": "branch", "definition": "A point in a computer program at which one of two or more alternative sets of program statements is selected for execution." }, { "term": "buffer", "definition": "A device or storage area used to store data temporarily to compensate for differences in rates of data flow, time of occurrence of events, or amounts of data that can be handled by the devices or processes involved in the transfer or use of the data." }, { "term": "busy", "definition": "Pertaining to a system or component that is operational, in service, and in use." }, { "term": "byte", "definition": "A group of adjacent binary digits operated upon as a unit and usually shorter than a computer word (frequently connotes a group of eight bits)." }, { "term": "cache", "definition": "A special-purpose buffer storage, smaller and faster than main storage, used to hold a copy of instructions and data obtained from main storage and likely to be needed next by the processor." }, { "term": "call", "definition": "A computer instruction that transfers control from one software module to another and, often, specifies the parameters to be passed to and from the module." }, { "term": "case", "definition": "A single-entry, single-exit multipleway branch that defines a control expression, specifies the processing to be performed for each value of the control expression, and returns control in all instances to the statement immediately following the overall construct." }, { "term": "class", "definition": "specifies the object’s internal representation and defines the operations that the object can be instructed to perform." }, { "term": "clear", "definition": "To set a variable, register, or other storage location to zero, blank, or other null value" }, { "term": "client", "definition": "A computer system or process that requests a service of another computer system or process (a server)." }, { "term": "command", "definition": "An expression that can be input to a computer system to initiate an action or affect the execution of a computer program" }, { "term": "comment", "definition": "Information embedded within a computer program, job control statements, or a set of data, that provides clarification to human readers but does not affect machine interpretation." }, { "term": "compile", "definition": "To translate a computer program expressed in a high order language into its machine language equivalent." }, { "term": "cookie", "definition": "Information that a web setver stores on a user's computer when the user browses a particular Web site." }, { "term": "counter", "definition": "A variable used to record the number of occurrences of a given event during the execution of a computer program; for example, a variable that records the number of times a loop is executed." }, { "term": "crash", "definition": "The sudden and complete failure of a computer system or component" }, { "term": "cycle", "definition": "A period of time during which a set of events is completed." }, { "term": "data", "definition": "A representation of facts, concepts, or instructions in a manner suitable for communication, interpretation, or processing by humans or by automatic means." }, { "term": "debug", "definition": "To detect, locate, and correct faults in a computer program. Techniques include use of breakpoints, desk checking, dumps, inspection, reversible execution, single-step operation, and traces." }, { "term": "design", "definition": "The process of defining the architecture, components, interfaces, and other characteristics of a system or component." }, { "term": "driver", "definition": "A software module that invokes and, perhaps, controls and monitors the execution of one or more other software modules." }, { "term": "duplex", "definition": "Pertaining to communication in which data can be sent and received at the same time." }, { "term": "entity", "definition": "In computer programming, any item that can be named or denoted in a program. For example, a data item, program statement, or subprogram." }, { "term": "epoch", "definition": "The time and date corresponding to 0 in an operating system's clock and time-stamp values." }, { "term": "error", "definition": "The difference between a computed, observed, or measured value or condition and the true, specified, or theoretically correct value or condition." }, { "term": "ethernet", "definition": "Baseband LAN specification invented by Xerox Corporation and developed jointly by Xerox, Intel, and Digital Equipment Corporation." }, { "term": "execute", "definition": "To carry out an instruction, process, or computer program" }, { "term": "fetch", "definition": "To locate and load computer instructions or data from storage." }, { "term": "flag", "definition": "A variable that is set to a prescribed state, often “true” or “false,” based on the results of a process or the occurrence of a specified condition." }, { "term": "go to", "definition": "A computer program statement that causes a jump." }, { "term": "gzip", "definition": "a GNU free software file compression program. It was created by Jean-loup Gailly and Mark Adler." }, { "term": "header", "definition": "The portion of a message that contains control information for the message such as one or more destination fields, name of the originating station,input sequence number, character string indicating the type of message, and priority level for the message." }, { "term": "idle", "definition": "Pertaining to a system or component that is operational and in service, but not in use." }, { "term": "input", "definition": "Pertaining to data received from an external source." }, { "term": "kernel", "definition": "That portion of an operating system that is kept in main memory at all times and it performs basic functions such as allocating hardware resources." }, { "term": "label", "definition": "A name or identifier assigned to a computer program statement to enable other statements to refer to that statement." }, { "term": "latency", "definition": "The time interval between the instant at which an instruction control unit issues a call for data and the instant at which the transfer of data is started." }, { "term": "literal", "definition": "In a source program, an explicit representation of the value of an item; for example, the word FAIL in the instruction: If x = 0 then print “FAIL”." }, { "term": "loop", "definition": "A sequence of computer program statements that is executed repeatedly until a given condition is met or while a given condition is true." }, { "term": "metric", "definition": "A measure of software quality which indicate the complexity, understandability, testability, description and intricacy of code." }, { "term": "module", "definition": "A logically separable part of a program." }, { "term": "object", "definition": "A run-time entity that packages both data and the procedures that operate on that data." }, { "term": "package", "definition": "A separately compilable software component consisting of related data types, data objects, and subprograms" }, { "term": "pointer", "definition": "A data element that indicates the location of another data element." }, { "term": "port", "definition": "A system or network access point for data entry or exit." }, { "term": "queue", "definition": "A list in which items are appended to the last position of the list and retrieved from the first position of the list." }, { "term": "reflection", "definition": "The ability of a computer program to examine, introspect, and modify its own structure and behavior at runtime." }, { "term": "reset", "definition": "To set a variable, register, or other storage location back to a prescribed state." }, { "term": "return", "definition": "To transfer control from a software module to the module that called it. Or, to assign a value to a parameter that is accessible by a calling module." }, { "term": "roll in", "definition": "To transfer data or computer program segments from auxiliary storage to main storage." }, { "term": "routine", "definition": "A subprogram that is called by other programs and subprograms." }, { "term": "salt", "definition": "a random string of data used to modify a password hash. " }, { "term": "shell", "definition": "computer program or routine that provides an interface between the user and a computer system or program." }, { "term": "snapshot", "definition": "A copy of the data in a database at any given point in time." }, { "term": "spam", "definition": "An inappropriate attempt to use a mailing list, or USENET or other networked communications facility as if it was a broadcast medium (which it is not) by sending the same message to a large number of people who didn't ask for it." }, { "term": "stub", "definition": "a piece of code used to stand in for some other programming functionality. It may simulate the behavior of existing code (such as a procedure on a remote machine) or be a temporary substitute for yet-to-be-developed code." }, { "term": "swap", "definition": "An exchange of the contents of two storage areas, usually an area of main storage with an area of auxiliary storage." }, { "term": "syntax", "definition": "The structural or grammatical rules that define how the symbols in a language are to be combined to form words, phrases, expressions, and other allowable constructs." }, { "term": "system", "definition": "A collection of components organized to accomplish a specific function or set of functions." }, { "term": "torrent", "definition": "A method of making data available for download over the internet, where the recipient of data is expected to make the data available to others for download from their PC, rather than all users downloading from a central server." }, { "term": "traceroute", "definition": "Program available on many systems that traces the path a packet takes to a destination." }, { "term": "word", "definition": "A sequence of bits. or characters that is stored, addressed, transmitted, and operated on as a unit within a given computer." }]