[{
    "abnormal end": "Termination of a process prior to completion",
    "abort": "To terminate a process prior to completion",
    "absolute address": "An address that is permanently assigned to a device or storage location and that identifies the device or location without the need for translation or calculation.",
    "absolute assembler": "An assembler that produces absolute code",
    "absolute code": "Code in which all addresses are absolute addresses",
    "absolute instruction": "A computer instruction in which all addresses are absolute addresses.",
    "absolute loader": "A loader that reads absolute machine code into main memory, beginning at the initial address assigned to the code by the assembler or compiler, and performs no address adjustments on the code",
    "abstract data type": "A data type for which only the properties of the data and the operations to be performed on the data are specified, without concern for how the data will be represented or how the operations will be implemented.",
    "abstraction": "A view of an object that focuses on the information relevant to a particular purpose and ignores the remainder of the information",
    "acceptance criteria": "The criteria that a system or component must satisfy in order to be accepted by a user, customer, or other authorized entity.",
    "acceptance testing": "Formal testing conducted to enable a user, customer, or other authorized entity to determine whether to accept a system or component",
    "accuracy": "A qualitative assessment of correctness, or freedom from error.",
    "active redundancy": "In fault tolerance, the use of redundant elements operating simultaneously to prevent, or permit recovery from, failures",
    "adaptation data": "Data used to adapt a program to a given installation site or to given conditions in its operational environment",
    "adaptation parameter": "A variable that is given a specific value to adapt a program to a given installation site or to given conditions in its operational environment; for example, the variable Installation-Site-Latitude",
    "adaptive maintenance": "Software maintenance performed to make a computer program usable in a changed environment",
    "address": "A number, character, or group of characters that identifies a given device or storage location.",
    "address field": "Any of the fields of a computer instruction that contain addresses, information necessary to derive addresse;, or values of operands",
    "address format": "The number and arrangement of address fields in a computer instruction",
    "address space": "The addresses that a computer program can access or the number of memory locations that a central processing unit can address.",
    "addressing exception": "An exception that occurs when a program calculates an address outside the bounds of the storage available to it.",
    "afferent": "Pertaining to a flow of data or control from a subordinate module to a superordinate module in a software system.",
    "algebraic language": "A programming language that permits the construction of statements resembling algebraic expressions, such as Y = X + 5. For example, FORTRAN.",
    "algorithm": "A finite set of well-defined rules for the solution of a problem in a finite number of steps; for example, a complete specification of a sequence of arithmetic operations for evaluating sine x to a given precision",
    "algorithmic language": "A programming language designed for expressing algorithms; for example, ALGOL.",
    "alias": "In an internet, a name assigned to a server that makes the server independent of the name of its host machine.",
    "allocation": "The process of distributing requirements, resources, or other entities among the components of a system or program.",
    "anomaly": "Anything observed in the documentation or operation of software that deviates from expectations based on previously verified software products or reference documents.",
    "anticipatory buffering": "A buffering technique in which data are stored in a buffer in anticipation of a need for the data.",
    "anticipatory paging": "A storage allocation technique in which pages are transferred from auxiliary storage to main storage in anticipation of a need for those pages.",
    "applet": "An application program, written in the Java programming language, that can be retrieved from a Web server and executed by a Web browser.",
    "application generator": "A code generator that produces programs to solve one or more problems in a particular application area; for example, a payroll generator.",
    "application software": "Software designed to fulfill specific needs of a user; for example, software for navigation, payroll, or process control.",
    "architectural design": "The process of defining a collection of hardware and software components and their interfaces to establish the framework for the development of a computer system.",
    "architecture": "The organizational structure of a system or component.",
    "argument": "A constant, variable, or expression used in a call to a software module to specify data or program elements to be passed to that module.",
    "array": "An n-dimensional ordered set of data items identified by a single name and one or more indices, so that each element of the set is individually addressable.",
    "assemble": "To translate a computer program  expressed in an assembly language into its machine language equivalent.",
    "assemble-and-go": "An operating technique in which there are no stops between the assembling, linking, loading, and execution of a computer program.",
    "assembled origin": "The address of the initial storage location assigned to a computer program by an assembler, a compiler, or a linkage editor.",
    "assembler": "A computer program that translates programs expressed in assembly language into their machine language equivalents.",
    "assembly code": "Computer instructions and data definitions expressed in a form that can be recognized and processed by an assembler.",
    "assembly language": "A programming language that corresponds closely to the instruction set of a given computer, allows symbolic naming of operations and addresses, and usually results in a one-to-one translation of program instructions into machine instructions.",
    "assertion": "A logical expression specifying a program state that must exist or a set of conditions that program variables must satisfy at a particular point during program execution.",
    "assignment statement": "A computer program statement that assigns a value to a variable; for example, Y = X - 5",
    "asymmetric": "In computer security, pertaining to the use of different keys for encryption and decryption",
    "atomic type": "A data type, each of whose members consists of a single, nondecomposable data item.",
    "attribute": "A characteristic of an item; for example, the item's color, size, or type.",
    "authoring language": "A high level programming language used to develop courseware for computer-assisted instruction.",
    "availability": "The degree to which a system or component is operational and accessible when required for use.",
    "back-to-back testing": "Testing in which two or more variants of a program are executed with the same inputs, the outputs are compared, and errors are analyzed in case of discrepancies.",
    "background processing": "The execution of a low-priority process while higher priority processes are not using computer resources, or the execution of processes that do not require user interaction.",
    "backup": "A system, component, file, procedure, or person available to replace or help restore a primary item in the event of a failure or externally caused disaster.",
    "backward recovery": "A type of recovery in which a system, program, database, or other system resource is restored to a previous state in which it can perform required functions.",
    "base address": "An address used as a reference point to which a relative address is added to determine the address of the storage location to be accessed.",
    "batch": "Pertaining to a system or mode of operation in which inputs are collected and processed all at one time, rather than being processed as they arrive, and a job, once started, proceeds to completion without additional input or user interaction.",
    "batch file": "A file containing data that is to be processed unattended.",
    "bathtub curve": "A graph of the number of failures in a system or component as a function of time.",
    "beta test": "To test a prerelease version of a piece of software by making it available to selected customers and users.",
    "big-bang testing": "A type of integration testing in which software elements, hardware elements, or both are combined all at once into an overall system, rather than in stages.",
    "binary digit": "A unit of information that can be represented by either a zero or a one.",
    "bind": "To assign a value to an identifier. For example, to assign a value to a parameter or to assign an absolute address to a symbolic address in a computer program.",
    "bitmap": "A representation of an image by an array of bits.",
    "black box": "A system or component whose inputs, outputs, and general function are known but whose contents or implementation are unknown or irrelevant",
    "block": "A group of contiguous storage locations, computer program statements, records, words, characters, or bits that are treated as a unit.",
    "block diagram": "A diagram of a system, computer, or device in which the principal parts are represented by suitably annotated geometrical figures to show both the functions of the parts and their functional relationships",
    "block-structured language": "A design or programming language in which sequences of statements, called blocks, are defined, usually with begin and end delimiters, and variables or labels defined in one block are not recognized outside that block. Examples include Ada, ALGOL, PL/I.",
    "boot": "To initialize a computer system by clearing memory and reloading the operating system.",
    "bootstrap": "A short computer program that is permanently resident or easily loaded into a computer and whose execution brings a larger program, such as an operating system or its loader, into memory.",
    "bottleneck": "A hardware or software component that can limit the performance of a device, a subsystem (such as an adapter), or a network.",
    "boundary value": "A data value that corresponds to a minimum or maximum input, internal, or output value specified for a system or component.",
    "box diagram": "A control flow diagram consisting of a rectangle that is subdivided to show sequential steps, if-then-else conditions, repetition, and case conditions.",
    "branch": "A point in a computer program at which one of two or more alternative sets of program statements is selected for execution.",
    "branch testing": "Testing designed to execute each outcome of each decision point in a computer program.",
    "breakpoint": "A point in a computer program at which execution can be suspended to permit manual or automated monitoring of program performance or results.",
    "bubble chart": "A data flow, data structure, or other diagram in which entities are depicted with circles (bubbles) and relationships are represented by links drawn between the circles.",
    "buffer": "A device or storage area used to store data temporarily to compensate for differences in rates of data flow, time of occurrence of events, or amounts of data that can be handled by the devices or processes involved in the transfer or use of the data.",
    "busy": "Pertaining to a system or component that is operational, in service, and in use.",
    "busy time": "In computer performance engineering, the period of time during which a system or component is operational, in service, and in use.",
    "byte": "A group of adjacent binary digits operated upon as a unit and usually shorter than a computer word (frequently connotes a group of eight bits).",
    "cache": "A special-purpose buffer storage, smaller and faster than main storage, used to hold a copy of instructions and data obtained from main storage and likely to be needed next by the processor.",
    "call": "A computer instruction that transfers control from one software module to another and, often, specifies the parameters to be passed to and from the module.",
    "call by name": "A method for passing parameters, in which the calling module provides to the called module a symbolic expression representing the parameter to be passed, and a service routine evaluates the expression and provides the resulting value to the called module.",
    "call by reference": "A method for passing parameters, in which the calling module provides to the called module the address of the parameter to be passed.",
    "call by value": "A method of passing parameters, in which the calling module provides to the called module the actual value of the parameter to be passed.",
    "call graph": "A diagram that identifies the modules in a system or computer program and shows which modules call one another",
    "call list": "The ordered list of arguments used in a call to a software module.",
    "calling sequence": "A sequence of computer instructions and, possibly, data necessary to perform a call to another module.",
    "case": "A single-entry, single-exit multipleway branch that defines a control expression, specifies the processing to be performed for each value of the control expression, and returns control in all instances to the statement immediately following the overall construct.",
    "catastrophic failure": "A failure of critical software.",
    "character": "A letter, digit, or other symbol that is used to represent information.",
    "character type": "A data type whose members can assume the values of specified characters and can be operated on by character operators, such as concatenation.",
    "checkout": "Testing conducted in the operational or support environment to ensure that a software product performs as required after installation.",
    "checkpoint": "A point in a computer program at which program state, status, or results are checked or recorded.",
    "class": "specifies the object’s internal representation and defines the operations that the object can be instructed to perform.",
    "clear": "To set a variable, register, or other storage location to zero, blank, or other null value",
    "client": "A computer system or process that requests a service of another computer system or process (a server).",
    "closed loop": "A loop that has no exit and whose execution can be interrupted only by intervention from outside the computer program or procedure in which the loop is located",
    "closed system": "",
    "code breakpoint": "A breakpoint that is initiated upon execution of a given computer instruction.",
    "code generator": "A software tool that accepts as input the requirements or design for a computer program and produces source code that implements the requirements or design.",
    "code review": "A meeting at which software code is presented to project personnel, managers, users, customers, or other interested parties for comment or approval.",
    "cohesion": "The manner and degree to which the tasks performed by a single software module are related to one another.",
    "coincidental cohesion": "A type of cohesion in which the tasks performed by a software module have no functional relationship to one another.",
    "command": "An expression that can be input to a computer system to initiate an action or affect the execution of a computer program",
    "command-driven": "Pertaining to a system or mode of operation in which the user directs the system through commands.",
    "comment": "Information embedded within a computer program, job control statements, or a set of data, that provides clarification to human readers but does not affect machine interpretation.",
    "common storage": "A portion of main storage that can be accessed by two or more modules in a software system",
    "communicational cohesion": "A type of cohesion in which the tasks performed by a software module use the same input data or contribute to producing the same output data.",
    "comparator": "A software tool that compares two computer programs, files, or sets of data to identify commonalities or differences.",
    "compatibility": "The ability of two or more systems or components to perform their required functions while sharing the same hardware or software environment.",
    "compile": "To translate a computer program expressed in a high order language into its machine language equivalent.",
    "compile-and-go": "An operating technique in which there are no stops between the compiling, linking, loading, and execution of a computer program.",
    "compiler": "A computer program that translates programs expressed in a high order language into their machine language equivalents.",
    "compiler generator": "A translator or interpreter used to construct part or all of a compiler.",
    "component": "One of the parts that make up a system.",
    "component testing": "Testing of individual hardware or software components or groups of related components.",
    "composite type": "A data type each of whose members is composed of multiple data items. For example, a data type called PAIRS whose members are ordered pairs (xy).",
    "computer instruction": "A statement in a programming language, specifying an operation to be performed by a computer and the addresses or values of the associated operands; for example, Move A to B.",
    "computer resource allocation": "The assignment of computer resources to current and waiting jobs; for example, the assignment of main memory, input/output devices, and auxiliary storage to jobs executing concurrently in a computer system.",
    "concurrent": "Pertaining to the occurrence of two or more activities within the same interval of time, achieved either by interleaving the activities or by simultaneous execution.",
    "concurrent server": "a server that can handle many connections at the same time.",
    "constant": "A quantity or data item whose value cannot change; for example, the data item FIVE, with an unchanging value of 5.",
    "content coupling": "A type of coupling in which some or all of the contents of one software module are included in the contents of another module.",
    "contiguous allocation": "A storage allocation technique in which programs or data to be stored are allocated a block of storage of equal or greater size, so that logically contiguous programs and data are assigned physically contiguous storage locations.",
    "control coupling.": "A type of coupling in which one software module communicates information to another module for the explicit purpose of influencing the latter module's execution.",
    "control data": "Data that select an operating mode, direct the sequential flow of a program, or otherwise directly influence the operation of software; for example, a loop control variable",
    "control flow": "The sequence in which operations are performed during the execution of a computer program.",
    "control flow diagram": "A diagram that depicts the set of all possible sequences in which operations may be performed during the execution of a system or program.",
    "control statement": "A program statement that selects among alternative sets of program statements or affects the order in which operations are performed.",
    "conversational": "Pertaining to an interactive system or mode of operation in which the interaction between the user and the system resembles a human dialog.",
    "cookie": "Information that a web setver stores on a user's computer when the user browses a particular Web site.",
    "coroutine": "A routine that begins execution at the point at which operation was last suspended, and that is not required to return control to the program or subprogram that called it.",
    "corrective maintenance": "Maintenance performed to correct faults in hardware or software.",
    "counter": "A variable used to record the number of occurrences of a given event during the execution of a computer program; for example, a variable that records the number of times a loop is executed.",
    "coupling": "The manner and degree of interdependence between software modules.",
    "crash": "The sudden and complete failure of a computer system or component",
    "critical software": "Software whose failure could have an impact on safety, or could cause large financial or social loss.",
    "cross-assembler": "An assembler that executes on one computer but generates machine code for a different computer.",
    "cross-compiler": "A compiler that executes on one computer but generates machine code for a different computer.",
    "cross-reference generator": "A software tool that accepts as input the source code of a computer program and produces as output a listing that identifies each of the program's variables, labels, and other identifiers and indicates which statements in the program define, set, or use each one.",
    "cross-reference list": "A list that identifies each of the variables, labels, and other identifiers in a computer program and indicates which statements in the program define, set, or use each one.",
    "cryptography": "The transformation of data to conceal its contents and to prevent one person form forging or modifying another person's messages.",
    "cycle": "A period of time during which a set of events is completed.",
    "cycle stealing": "The process of suspending the operation of a central processing unit for one or more cycles to permit the occurrence of other operations, such as transferring data from main memory in response to an output request from an input/output controller.",
    "cyclic search": "A storage allocation technique in which each search for a suitable block of storage begins with the block following the one last allocated.",
    "data": "A representation of facts, concepts, or instructions in a manner suitable for communication, interpretation, or processing by humans or by automatic means.",
    "data abstraction": "The process of extracting the essential characteristics of data by defining data types and their associated functional characteristics and disregarding representation details.",
    "data breakpoint": "A breakpoint that is initiated when a specified data item is accessed.",
    "data coupling": "A type of coupling in which output from one software module serves as input to another module.",
    "data exception": "An exception that occurs when a program attempts to use or access data incorrectly.",
    "data flow": "The sequence in which data transfer, use, and transformation are performed during the execution of a computer program.",
    "Data Flow Analysis": "A process to discover the dependencies between different data items manipulated by a program. ",
    "data flow diagram": "A diagram that depicts data sources, data sinks, data storage, and processes performed on data as nodes, and logical flow of data as links between the nodes.",
    "data-sensitive fault": "A fault that causes a failure in response to some particular pattern of data.",
    "data structure": "A physical or logical relationship among data elements, designed to support specific data manipulation functions.",
    "data type": "A class of data, characterized by the members of the class and the operations that can be applied to them.",
    "database": "A collection of interrelated data stored together in one or more computerized files.",
    "deadlock": "A situation in which computer processing is suspended because two or more devices or processes are each awaiting resources assigned to the others.",
    "debug": "To detect, locate, and correct faults in a computer program. Techniques include use of breakpoints, desk checking, dumps, inspection, reversible execution, single-step operation, and traces.",
    "decision table": "A table used to show sets of conditions and the actions resulting from them.",
    "declaration": "A non-exe cut a ble program statement that affects the assembler or compiler's interpretation of other statements in the program. For example, a statement that identifies a name, specifies what the name represents, and, possibly, assigns it an initial value.",
    "declarative language": "A nonprocedural language that permits the user to declare a set of facts and to express queries or problems that use these facts.",
    "decompile": "To translate a compiled computer program from its machine language version into a form that resembles, but may not be identical to, the original high order language program.",
    "decoupling": "The process of making software modules more independent of one another to decrease the impact of changes to, and errors in, the individual modules.",
    "delimiter": "A character or set of characters used to denote the beginning or end of a group of related bits, characters, words, or statements.",
    "demand paging": "A storage allocation technique in which pages are transferred from auxiliary storage to main storage only when those pages are needed.",
    "demodularization": "In software design, the process of combining related software modules, usually to optimize system performance.",
    "derived type": "A data type whose members and operations are taken from those of another data type according to some specified rule.",
    "design": "The process of defining the architecture, components, interfaces, and other characteristics of a system or component.",
    "design description": "A document that describes the design of a system or component. Typical contents include system or component architecture, control logic, data structures, input/ output formats, interface descriptions, and algorithms.",
    "Design Pattern": " systematically names, motivates and explains a general design that addresses a recurring design problem in object-oriented systems. It describes the problem, the solution, when to apply the solution and it’s consequences. It also gives implementation hints and examples. ",
    "destination address": "The address of the device or storage location to which data is to be transferred.",
    "development testing": "Formal or informal testing conducted during the development of a system or component, usually in the development environment by the developer.",
    "direct address": "An address that identifies the storage location of an operand.",
    "direct instruction": "A computer instruction that contains the direct addresses of its operands.",
    "directed graph": "A graph in which direction is implied in the internode connections",
    "disassemble": "To translate an assembled computer program from its machine language version into a form that resembles, but may not be identical to, the original assembly language program.",
    "documentation tree": "A diagram that depicts all of the documents for a given system and shows their relationships to one another.",
    "down time": "The period of time during which a system or component is not operational or has been taken out of service.",
    "downward compatible": "Pertaining to hardware or software that is compatible with an earlier or less complex version of itself; for example, a program that handles files created by an earlier version of itself.",
    "driver": "A software module that invokes and, perhaps, controls and monitors the execution of one or more other software modules.",
    "duplex": "Pertaining to communication in which data can be sent and received at the same time.",
    "dynamic binding": "Binding performed during the execution of a computer program.",
    "dynamic error": "An error that is dependent on the time-varying nature of an input.",
    "dynamic relocation": "Relocation of a computer program during its execution.",
    "dynamic resource allocation": "computer resource allocation technique in which the resources assigned to a program vary during program execution, based on current need.",
    "efferent": "Pertaining to a flow of data or control from a superordinate module to a subordinate module in a software system",
    "efficiency": "The degree to which a system or component performs its designated functions with minimum consumption of resources.",
    "embedded computer system": "A computer system that is part of a larger system and performs some of the requirements of that system; for example, a computer system used in an aircraft or rapid transit system.",
    "embedded software": "Software that is part of a larger system and performs some of the requirements of that system; for example, software used in an aircraft or rapid transit system.",
    "emulation": "A model that accepts the same inputs and produces the same outputs as a given system.",
    "emulator": "A device, computer program, or system that accepts the same inputs and produces the same outputs as a given system.",
    "encapsulation": "A software development technique that consists of isolating a system function or a set of data and operations on those data within a module and providing precise specifications for the module.",
    "encryption": "In computer security, the process of transfoming data into an unintelligible form in such a way that the original data either cannot be obtained or can be obtained only by using a decryption process.",
    "entity": "In computer programming, any item that can be named or denoted in a program. For example, a data item, program statement, or subprogram.",
    "entity attribute": "A named characteristic or property of a design entity. It provides a statement of fact about the entity.",
    "entity-relationship diagram": "A diagram that depicts a set of real-world entities and the logical relationships among them.",
    "entry point": "A point in a software module at which execution of the module can begin.",
    "enumeration type": "A discrete data type whose members can assume values that are explicitly defined by the programmer. For example, a data type called COLORS with possible values RED, BLUE, and YELLOW.",
    "epoch": "The time and date corresponding to 0 in an operating system's clock and time-stamp values.",
    "error": "The difference between a computed, observed, or measured value or condition and the true, specified, or theoretically correct value or condition.",
    "error seeding": "The process of intentionally adding known faults to those already in a computer program for the purpose of monitoring the rate of detection and removal, and estimating the number of faults remaining in the program.",
    "error tolerance": "The ability of a system or component to continue normal operation despite the presence of erroneous inputs.",
    "exception": "An event that causes suspension of normal program execution.",
    "execute": "To carry out an instruction, process, or computer program",
    "execution efficiency": "The degree to which a system or component performs its designated functions with minimum consumption of time.",
    "execution time": "The amount of elapsed time or processor time used in executing a computer program.",
    "execution trace": "A record of the sequence of instructions executed during the execution of a computer program.",
    "exit routine": "A routine that receives control when a specified event, such as an error, occurs.",
    "extendability": "The ease with which a system or component can be modified to increase its storage or functional capacity.",
    "factoring": "The process of decomposing a system into a hierarchy of modules.",
    "fail safe": "Pertaining to a system or component that automatically places itself in a safe operating mode in the event of a failure; for example, a traffic light that reverts to blinking red in all directions when normal operation fails.",
    "failure mode": "The physical or functional manifestation of a failure. For example, a system in failure mode may be characterized by slow operation, incorrect outputs, or complete termination of execution.",
    "fatal error": "An error that results in the complete inability of a system or component to function.",
    "fault dictionary": "A list of faults in a system or component, and the tests that have been designed to detect them.",
    "fault masking": "A condition in which one fault prevents the detection of another.",
    "fault tolerance": "The ability of a system or component to continue normal operation despite the presence of hardware or software faults",
    "fetch": "To locate and load computer instructions or data from storage.",
    "fifth generation language": "A computer language that incorporates the concepts of knowledge-based systems, expert systems, inference engines, and natural language processing.",
    "firewall": "In communication, a functinal unit that protects and controls the connection of one network to other networks.",
    "firmware": "Proprietary code that is usually delivered as microcode as part of an operating system.",
    "flag": "A variable that is set to a prescribed state, often “true” or “false,” based on the results of a process or the occurrence of a specified condition.",
    "flowchart": "A control flow diagram in which suitably annotated geometrical figures are used to represent operations, data, or equipment, and arrows are used to indicate the sequential flow from one to another.",
    "flowcharter": "A software tool that accepts as input a design or code representation of a program and produces as output a flowchart of the program.",
    "foreground processing": "The execution of a high-priority process while lower-priority processes await the availability of computer resources, or the execution of processes that require user interaction.",
    "formal language": "A language whose rules are explicitly established prior to its use. Examples include programming languages and mathematical languages.",
    "forward recovery": "A type of recovery in which a system, program, database, or other system resource is restored to a new, not previously occupied state in which it can perform required functions.",
    "fourth generation language": "A computer language designed to improve the productivity achieved by high order languages and, often, to make computing power available to non-programmers.",
    "fragmentation": "An operating system's process of writing different parts of a file to discontiguous sectors on a computer storage medium when contiguous space that is large enough to contain the entire file is not available",
    "function": "A software module that performs a specific action, is invoked by the appearance of its name in an expression, may receive input values, and returns a single value.",
    "functional cohesion": "A type of cohesion in which the tasks performed by a software module all contribute to the performance of a single function.",
    "functional decomposition": "A type of modular decomposition in which a system is broken down into components that correspond to system functions and subfunctions.",
    "functional language": "A programming language used to express programs as a sequence of functions and function calls.",
    "functional testing": "Testing that ignores the internal mechanism of a system or component and focuses solely on the outputs generated in response to selected inputs and execution conditions.",
    "garbage collection": "The process of identifying unused areas of main storage.",
    "generated address": "An address that has been calculated during the execution of a computer program.",
    "globa1 variable": "A variable that can be accessed by two or more non-nested modules of a computer program without being explicitly passed as a parameter between the modules.",
    "go to": "A computer program statement that causes a jump.",
    "graphical user interface": "The use of pictures rather than just words to represent the input and output of a program.",
    "half-duplex": "In data communication, pertaining to transmission in only one direction at a time.",
    "hard failure": "A failure that results in complete shutdown of a system.",
    "header": "The portion of a message that contains control information for the message such as one or more destination fields, name of the originating station,input sequence number, character string indicating the type of message, and priority level for the message.",
    "high level language": "A programming language that requires little knowledge of the computer on which a program will run, can be translated into several different machine languages, allows symbolic naming of operations and addresses, provides features designed to facilitate expression of data structures and program logic, and usually results in several machine instructions for each program statement.",
    "host machine": "A computer used to develop software intended for another computer. ",
    "housekeeping operation": "A computer operation that establishes or reestablishes a set of initial conditions to facilitate the execution of a computer program; for example, initializing storage areas, clearing flags, opening and closing files.",
    "Hypermedia": "An extension of hypertext to include graphics, sound, video and other kinds of data.",
    "identifier": "The name, address, label, or distinguishing index of an object in a computer program.",
    "idle": "Pertaining to a system or component that is operational and in service, but not in use.",
    "idle time": "The period of time during which a system or component is operational and in service, but not in use.",
    "incremental development": "A software development technique in which requirements definition, design, implementation, and testing occur in an overlapping, iterative (rather than sequential) manner, resulting in incremental completion of the overall software product.",
    "indigenous error": "A computer program error that has not been purposely inserted as part of an error-seeding process.",
    "indirect address": "An address that identifies the storage location of another address.",
    "inherited error": "An error carried forward from a previous step in a sequential process",
    "initialize": "To set a variable, register, or other storage location to a starting value.",
    "input": "Pertaining to data received from an external source.",
    "input assertion": "A logical expression specifying one or more conditions that program inputs must satisfy in order to be valid.",
    "instruction set": "The complete set of instructions recognized by a given computer or provided by a given programming language.",
    "instruction time": "The time it takes a computer to fetch an instruction from memory and execute it.",
    "integration": "The process of combining software components, hardware components, or both into an overall system.",
    "integration testing": "Testing in which software components, hardware components, or both are combined and tested to evaluate the interaction between them.",
    "interactive language": "A nonprocedural language in which a program is created as a result of interactive dialog between the user and the computer system.",
    "interface": "A shared boundary across which information is passed.Or, to connect two or more components for the purpose of passing information from one to the other.",
    "intermittent fault": "A temporary or unpredictable fault in a component.",
    "Internationalisation": "The process of altering a program so that it is portable across several native languages.",
    "interoperability": "The ability of two or more systems or components to exchange information and to use the information that has been exchanged.",
    "interpreter": "A computer program that translates and executes each statement or construct of a computer program before translating and executing the next.",
    "interrupt request": "A signal or other input requesting that the currently executing process be suspended to permit performance of another process.",
    "iteration": "The process of performing a sequence of steps repeatedly.",
    "kernel": "That portion of an operating system that is kept in main memory at all times and it performs basic functions such as allocating hardware resources.",
    "label": "A name or identifier assigned to a computer program statement to enable other statements to refer to that statement.",
    "language processor": "A computer program that translates, interprets, or performs other tasks required to process statements expressed in a given language.",
    "latency": "The time interval between the instant at which an instruction control unit issues a call for data and the instant at which the transfer of data is started.",
    "literal": "In a source program, an explicit representation of the value of an item; for example, the word FAIL in the instruction: If x = 0 then print “FAIL”.",
    "local variable": "A variable that can be accessed by only one module or set of nested modules in a computer program.",
    "loop": "A sequence of computer program statements that is executed repeatedly until a given condition is met or while a given condition is true.",
    "machine code": "Computer instructions and data definitions expressed in a form that can be recognized by the processing unit of a computer.",
    "machine language": "A language that can be recognized by the processing unit of a computer.",
    "maintenance": "The process of modifying a software system or component after delivery to correct faults, improve performance or other attributes, or adapt to a changed environment.",
    "memory leak": "A condition in which a computer program allocates memory and does not free (or properly free) this memory. If the program continues to run and is not terminated, it uses large amounts of real memory and eventually runs out of memory.",
    "metalanguage": "A language used to specify some or all aspects of a language",
    "metric": "A measure of software quality which indicate the complexity, understandability, testability, description and intricacy of code.",
    "middleware": "Software that mediates between an application program and a network. It manages the interaction between disparate applications across the heterogeneous computing platforms. ",
    "modular programming": "A software development technique in which software is developed as a collection of modules.",
    "modularity": "The degree to which a system or computer program is composed of discrete components such that a change to one component has minimal impact on other components.",
    "module": "A logically separable part of a program.",
    "multicast": "Transmission of the same data to a selected group of destinations.",
    "multiprocessing": "A mode of operation in which two or more processes are executed concurrently by separate processing units that have access (usually) to a common main storage.",
    "multiprogramming": "A mode of operation in which two or more computer programs are executed in an interleaved manner by a single processing unit.",
    "multitasking": "A mode of operation in which two or more tasks are executed in an interleaved manner.",
    "object": "A run-time entity that packages both data and the procedures that operate on that data.",
    "operating system": "A collection of software, firmware, and hardware elements that controls the execution of computer programs and provides such services as computer resource allocation, job control, input/output control, and file management in a computer system",
    "operational testing": "Testing conducted to evaluate a system or component in its operational environment.",
    "output assertion": "A logical expression specifying one or more conditions that program outputs must satisfy in order for the program to be correct.",
    "overflow exception": "An exception that occurs when the result of an arithmetic operation exceeds the size of the storage location designated to receive it.",
    "overload": "To assign an operator, identifier, or literal more than one meaning, depending upon the data types associated with it at any given time during program execution.",
    "package": "A separately compilable software component consisting of related data types, data objects, and subprograms",
    "parity bit": "A check bit appended to an array of binary digits to make the sum of all the binary digits, including the check bit, always odd or always even.",
    "performance": "The degree to which a system or component accomplishes its designated functions within given constraints, such as speed, accuracy, or memory usage.",
    "performance testing": "Testing conducted to evaluate the compliance of a system or component with specified performance requirements.",
    "pervasive computing": "The use of a computing infrastructure that supports information appliances from which users can access a broad range of network-based services, including Internet-based e-commerce services.",
    "pipeline": "A software or hardware design technique in which the output of one process serves as input to a second, the output of the second process serves as input to a third, and so on",
    "pointer": "A data element that indicates the location of another data element.",
    "port": "A system or network access point for data entry or exit.",
    "portability": "The ease with which a system or component can be transferred from one hardware or software environment to another.",
    "preliminary design": "The process of analyzing design alternatives and defining the architecture, components, interfaces, and timing and sizing estimates for a system or component.",
    "private type": "data type whose structure and possible values are defined but are not revealed to the user of the type.",
    "procedural language": "A programming language in which the user states a specific set of instructions that the computer must perform in a given sequence.",
    "program synthesis": "The use of software tools to aid in the transformation of a program specification into a program that realizes that specification.",
    "protocol": "A set of conventions that govern the interaction of processes, devices, and other components within a system.",
    "prototype": "A preliminary type, form, or instance of a system that serves as a model for later stages or for the final, complete version of the system.",
    "proxy server": "A server that receives requests intended for another server and that acts on the client's behalf to obtain the requested service.",
    "pseudo code": "A combination of programming language constructs and natural language used to express a computer program design.",
    "query language": "A language used to access information stored in a database.",
    "queue": "A list in which items are appended to the last position of the list and retrieved from the first position of the list.",
    "recovery": "The restoration of a system, program, database, or other system resource to a state in which it can perform required functions.",
    "recursion": "A process in which a software module calls itself.",
    "recursive": "Pertaining to a software module that calls itself.",
    "regression testing": "Selective retesting of a system or component to verify that modifications have not caused unintended effects and that the system or component still complies with its specified requirements.",
    "register": "A part of internal storage having a specified storage capacity and usually intended for a specific purpose.",
    "requirements analysis": "The process of studying user needs to arrive at a definition of system, hardware, or software requirements.",
    "requirements phase": "The period of time in the software life cycle during which the requirements for a software product are defined and documented.",
    "reserved word": "A word in a programming language whose meaning is fixed by the rules of that language and which, in certain or all contexts, cannot be used by the programmer for any purpose other than its intended one.",
    "reset": "To set a variable, register, or other storage location back to a prescribed state.",
    "response time": "The elapsed time between the end of an inquiry or command to an interactive computer system and the beginning of the system's response.",
    "return": "To transfer control from a software module to the module that called it. Or, to assign a value to a parameter that is accessible by a calling module.",
    "return value": "A value assigned to a parameter by a called module for access by the calling module.",
    "reusability": "The degree to which a software module or other work product can be used in more than one computer program or software system.",
    "reversible execution": "A debugging technique in which a history of program execution is recorded and then replayed under the user’s control, in either the forward or backward direction.",
    "robustness": "The degree to which a system or component can function correctly in the presence of invalid inputs or stressful environmental conditions.",
    "roll in": "To transfer data or computer program segments from auxiliary storage to main storage.",
    "roll out": "To transfer data or computer program segments from main storage to auxiliary storage for the purpose of freeing main storage for other uses.",
    "root compiler": "A compiler whose output is a machine independent, intermediate-level representation of a program.",
    "routine": "A subprogram that is called by other programs and subprograms.",
    "run time": "The period of time during which a computer program is executing.",
    "scaffolding": "Computer programs and data files built to support software development and testing, but not intended to be included in the final product.",
    "security kernel": "A small, self-contained collection of key security-related statements that works as a privileged part of an operating system, specifying and enforcing. criteria that must be met for programs and data to be accessed.",
    "semantic error": "An error resulting from a misunderstanding of the relationship of symbols or groups of symbols to their meanings in a given language.",
    "shell": "computer program or routine that provides an interface between the user and a computer system or program.",
    "simulator": "A device, computer program, or system that behaves or operates like a given system when provided a set of controlled inputs.",
    "simultaneous recursion": "A situation in which two software modules call each other.",
    "soft failure": "A failure that permits continued operation of a system with partial operational capability.",
    "software life cycle": "The period of time that begins when a software product is conceived and ends when the software is no longer available for use.",
    "software repository": "A software library providing permanent, archival storage for software and related documentation.",
    "source address": "The address of a device or storage location from which data is to be transferred.",
    "source code": "Computer instructions and data definitions expressed in a form suitable for input to an assembler, compiler, or other translator.",
    "source program": "A computer program that must be compiled, assembled, or otherwise translated in order to be executed by a computer",
    "spiral model": "A model of the software development process in which the constituent activities, typically requirements analysis, preliminary and detailed design, coding, integration, and testing, are performed iteratively until the software is complete.",
    "Structured Query Language": "A language which provides a user interface to relational database management systems, developed by IBM in the 1970s.",
    "stand-alone": "Pertaining to hardware or software that is capable of performing its function without being connected to other components",
    "state diagram": "A diagram that depicts the states that a system or component can assume, and shows the events or circumstances that cause or result from a change from one state to another.",
    "statement": "In a programming language, a meaningful expression that defines data, specifies program actions, or directs the assembler or compiler.",
    "status code": "A code used to indicate the results of a computer program operation.",
    "straight-line code": "A sequence of computer instructions in which there are no loops.",
    "straight-line coding": "A programming technique in which loops are avoided by stating explicitly and in full all of the instructions that would be involved in the execution of each loop.",
    "strong typing": "A feature of some programming languages that requires the type of each data item to be declared, precludes the application of operators to inappropriate data types, and prevents the interaction of data items of incompatible types.",
    "structural testing": "Testing that takes into account the internal mechanism of a system or component.",
    "structured design": "Any disciplined approach to software design that adheres to specified rules based on principles such as modularity, top-down design, and stepwise refinement of data, system structures, and processing steps.",
    "structured program": "A computer program constructed of a basic set of control structures, each having one entry and one exit. The set of control structures typically includes:",
    "subprogram": "A separately compilable, executable component of a computer program.",
    "subroutine": "A routine that returns control to the program or subprogram that called it.",
    "swap": "An exchange of the contents of two storage areas, usually an area of main storage with an area of auxiliary storage.",
    "syntactic error": "A violation of the structural or grammatical rules defined for a language; for example, using the statement B + C = A in Fortran, rather than the correct A = B + C.",
    "syntax": "The structural or grammatical rules that define how the symbols in a language are to be combined to form words, phrases, expressions, and other allowable constructs.",
    "system": "A collection of components organized to accomplish a specific function or set of functions.",
    "target language": "The language in which the output from a machine-aided translation process is represented. For example, the language output by an assembler or compiler.",
    "target machine": "The computer on which a program is intended to execute.",
    "test log": "A chronological record of all relevant details about the execution of a test.",
    "throughput": "The amount of work that can be performed by a computer syst",
    "topology": "In communications, the physical or logical arrangement of nodes in a network, especially the relationships among nodes and the links between them.",
    "transaction": "A unit of interaction with a DBMS (DataBase Management System) or similar system. ",
    "turnaround time": "The elapsed time between the submission of a job to a batch processing system and the return of completed output.",
    "underflow exception": "An exception that occurs when the result of an arithmetic operation is too small a fraction to be represented by the storage location designated to receive it.",
    "upward compatible": "Pertaining to hardware or software that is compatible with a later or more complex version of itself; for example, a program that handles files created by a later version of itself.",
    "Uniform Resource Locator": "A draft standard for specifying an object on the Internet, such as a file or newsgroup",
    "usability": "The ease with which a user can learn to operate, prepare inputs for, and interpret outputs of a system or component.",
    "user interface": "An interface that enables information to be passed between a human user and hardware or software components of a computer system.",
    "variable": "A quantity or data item whose value can change",
    "variable trace": "A record of the name and values of variables accessed or changed during the execution of a computer program.",
    "word": "A sequence of bits. or characters that is stored, addressed, transmitted, and operated on as a unit within a given computer."

}]